/*
کنترل روشنایی  led  توسط کلید روی برد                                
                            pin(عدد بین 0 تا 255 برای تنظیم میزان روشنایی,اسم پایه);  
هر گاه مقدار p که میزان روشنایی را مشخص می کند به حداکثر(255) رسید اون را صفر می کند       
دوتا اسم معرفی کردیم برای ایجاد دو حافظه که عدد های که قرار دادیم در ابتدا در دو حافظه صفر می باشد    
از این مثال به بعدد از عمل استفاده کردن از حافظه را تعریف متغییر می نامیم و با معرفی متغییر اسم می بریم   
 متغییر p در if که کلید را بررسی می کند 25 عدد گام افزایش این متغییر                    
 */
#include <arsalearn.h>
int i = 0,p = 0;
void setup() {
  run();
}
void loop() {
  i = pin(key);
  if(i == up) 
  {
    p = p + 25;
    if(p > 255) p = 0;
    pin(led,p);
  }
}
