/*
خاموش و روشن کردن led  توسط کلید روی برد                                
                            pin(عدد بین 0 تا 255 برای تنظیم میزان روشنایی,اسم پایه);  
   دستور if چک می کند که آیا کلید فشار داده شده یا خیر                           
   معنی عبارت up یعنی لحظه ای که کلید فشار داده شده                              
   معنی عبارت down یعنی لحظه ای که کلید را رها می کنید                            
 */
#include <arsalearn.h>
int i = 0;
void setup() {
  run();
}
void loop() {
  i = pin(key);
  if(i == up)   pin(led,high);
  if(i == down) pin(led,low);
}
