/*
                              شمارنده توسظ کلید روی برد و نمایش روی سریال مانیتور کامپیوتر                         
دستور ++p هر بار اجرا می شود یک واحد به p اضافه می شود                       
دوتا متغییر تعریف شده که مقدار اولیه آن ها صفر شده                            
توسط دستور Serial.println عبارتی که داخل پرانتز نوشته شده را در سریال مانیتور کامپیوتر می توانید ببنید       
 */
#include <arsalearn.h>
int i = 0,p = 0;
void setup() {
  run();
}
void loop() {
  i = pin(key);
  if(i == up) 
  {
    p++;
    Serial.print(p);
  }
}
