/*
با زدن هر بار اینتر کیبرد عبارت آمد گویی نمایش داده می شود                
معرفی متغیر از نوع نوشتاری و فقط امکان ریختن نوشته را درون خود دارد                
این دستور Serial.available در هنگامی که عبارتی ارسال شود به if اجازه می دهد که وارد دستورات بشود       
در صورتی که هیچ اطلاعاتی از سریال ارسال نشده باشد این if شرطش غلط است و وارد  زیر برنامه هاش نمی شود       
(char)Serial.read() این دستور به اطلاعات سریال را میخواند و به صورت متغیر تبدیل می کند تا اطلاعات ذخیره شود
if (data_ == '\n') این دستور هنگامی که اینتر ارسال می شود شرط این دستور صحیح می شود و برنامه های زیر تابع آن اجرا می شود
*/
#include <arsalearn.h>
String str = "wellcome";
void setup() {
  run();
}
void loop() {
  if(Serial.available())
  {
    char data_ = (char)Serial.read();
    if (data_ == '\n') 
    {
      Serial.println(str);
    }
  }
}
