/*
 کنترل میزان روشنایی  led                                             
                            pin(عدد بین 0 تا 255 برای تنظیم میزان روشنایی,اسم پایه);  
    تابع تاخیر که سبب می شمو به میزان مشخص شده برنامه صبر کند                            
                                          delay(عدد بر حسب میلی ثانیه);
                                 مشخص کردن قسمتی از حافظه برای ذخیر سازی یک مقدار که نام حافظه را به دلخواه میشود انتخاب کرد  
                                 int یعنی قسمتی از حافظه را انتخاب می کند
                                     i  میتونه هر اسمی به انگلیسی داشته باشه و کاملا اختیاریه
                                   مقدار اولیه را مساوی صفر قرار دادیم ;0=                                       
i = i + 1; قسمتی از حافظه را مقدارش با یک جمع کردیم و حاصل را قرار دادیم داخل همون حافظه و عدد حافظه آبدیت می شود
   for(گام شمارش , شرط ادامه شمارش , معرفی و حافظه و قرار دادن اسم برای آن و در نهایت ریختن عدد صفر در آن)
   این دستور یک حلقه که به میزان شرط و گام هاش میتواند این حلقه اجرا شود                   
   مثلا حلقه زیر گامش 1 و نهایت شرطش 255 یعنی این حلقه 255 بار اجرا میشود و هر بار i  یک گام بزرگتر می شود  
عدد شروع در حلقه زیر 255 یا حداکثر روشنایی                               
 در ادامه حلقه دیگر که کام هاش به صورت یک واحد کاهشی است شروع به کم کردن می کند تا شرط اینکه عدد i بزرگتر از صفر باشد
 */
#include <arsalearn.h>
void setup() {
  run();
}
void loop() {
  for(int i = 0 ; i < 255 ; i = i + 1)
  {
    pin(led , i);
    delay(10);
  }

  for(int i = 255 ; i > 0 ; i = i - 1)
  {
    pin(led , i);
    delay(10);
  }
}
